In [39]:
import pandas as pd
import numpy as np
import math

# sql
from sqlalchemy import create_engine

import warnings
warnings.filterwarnings("ignore")

In [41]:
#create engine
engine = create_engine('postgresql://racheldilley:localhost@localhost:5432/programer_database')

Upload servey data as sql table "survey2020" and "survey2019" to "programer_database"

In [42]:
# survey2020 = pd.read_csv('/Users/racheldilley/Documents/Metis/git_repos/operating-system-predictor/data/survey_results_public2020.csv')

# # name table survey2020
# survey2020.to_sql('survey2020', engine, index=False)

# survey2019 = pd.read_csv('../Documents/survey_results_public2019.csv')

# # name table survey2019
# survey2019.to_sql('survey2019', engine, index=False)

load region and survey data

In [124]:
country_regions_df = pd.read_csv('../Data/countries of the world.csv')

In [158]:
query = '''
SELECT "Hobbyist","MainBranch", "Age", "Age1stCode",  "Country", "DatabaseWorkedWith" as databases, 
"DevType", "EdLevel", "Employment", "Ethnicity", "Gender", "MiscTechWorkedWith" as developertools,
 "OpSys", "LanguageWorkedWith" as Language, "UndergradMajor", 
 "YearsCode", "YearsCodePro"
FROM survey2020
WHERE "OpSys" IS NOT NULL AND "OpSys" NOT IN ('BSD')
UNION
SELECT "Hobbyist","MainBranch", "Age", "Age1stCode",  "Country", "DatabaseWorkedWith" as databases, 
"DevType", "EdLevel", "Employment", "Ethnicity", "Gender", "MiscTechWorkedWith" as developertools,
 "OpSys", "LanguageWorkedWith" as Language, "UndergradMajor", 
"YearsCode", "YearsCodePro"
FROM survey2019
WHERE "OpSys" IS NOT NULL AND "OpSys" NOT IN ('BSD');
'''
df = pd.read_sql_query(query, engine)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 143887 entries, 0 to 143886
Data columns (total 17 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Hobbyist        143887 non-null  object
 1   MainBranch      143357 non-null  object
 2   Age             123638 non-null  float64
 3   Age1stCode      140595 non-null  object
 4   Country         143887 non-null  object
 5   databases       123482 non-null  object
 6   DevType         126543 non-null  object
 7   EdLevel         138674 non-null  object
 8   Employment      142035 non-null  object
 9   Ethnicity       121605 non-null  object
 10  Gender          134763 non-null  object
 11  developertools  98925 non-null   object
 12  OpSys           143887 non-null  object
 13  language        142245 non-null  object
 14  UndergradMajor  122175 non-null  object
 15  YearsCode       140689 non-null  object
 16  YearsCodePro    116645 non-null  object
dtypes: float64(1), object(16)
memory usage: 18.7+ MB

### Data Cleaning

Clean Target Data

In [199]:
df2 = df.copy()
df2.loc[:, 'OpSys'] = df['OpSys'].astype('category') #change to categorical data

#investigate target data
df2['OpSys'].value_counts()

Windows        68876
MacOS          37610
Linux-based    37401
Name: OpSys, dtype: int64

Change columns to numeric

In [225]:
df3 = df2.copy()
num_cols = ['Age',  'Age1stCode', 'YearsCode', 'YearsCodePro']
for col in num_cols:
    df3[col] = df3[col].apply(pd.to_numeric, errors='coerce')

Change Language column to list

In [226]:
df3['language'] = df3['language'].apply(lambda x: x.split(';') if x is not None else x)

Clean EdLevel

In [227]:
def get_education(row):
    '''
    A function that shortens survey responses to get categorical features
    combines masters and doctorates and secondary and primary schooling

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a str to update the EdLevel column in df
    '''
    try:
        if 'Bachelor' in row[7]:
            return 'BA/BS'
        elif 'Master' in row[7] or 'doctoral' in row[7]:
            return 'MA/PhD'
        elif 'Secondary' in row[7] or 'Primary' in row[7]:
            return 'Sec/Prim'
        elif 'Associate' in row[7]:
            return 'AA/AS'
        elif 'Professional' in row[7]:
            return 'Prof'
        elif 'Some' in row[7]:
            return 'Some Univ'
        else:
            return 'None'
    except: #fill na values
        if row[1] is not None:
            if 'student' in row[1]: #check if student 
                return 'Student'
        return row[7]

In [228]:
df3['EdLevel'] = df3.apply(get_education, axis=1) #update EdLevel column
df3['EdLevel'].value_counts()

BA/BS        63297
MA/PhD       35531
Some Univ    17126
Sec/Prim     15273
AA/AS         4612
Prof          1912
Student       1128
None           923
Name: EdLevel, dtype: int64

Clean Ethnicity column

In [229]:
#change values with value counts less than 150 to other
c = df3['Ethnicity'].value_counts()
df3['Ethnicity'] = np.where(df3['Ethnicity'].isin(c.index[c<250]), 'other', df3['Ethnicity'])

In [230]:
def get_ethnicity(row):
    '''
    A function that shortens survey responses to get categorical features
    combines asian ethnicities and changes values to biracial

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a str to update the Ethnicity column in df
    '''
    try:
        if 'Asian' in row[9]:
            return 'Asian'
        #if 2 races in list change to biracial
        elif 'Hispanic' in row[9] and 'White' in row[9]:
            return 'Biracial'
        elif 'Middle' in row[9] and 'White' in row[9]:
            return 'Biracial'
        elif 'Black' in row[9]:
            return 'Black'
        elif 'Hispanic' in row[9]:
            return 'Hispanic'
        elif 'White' in row[9]:
            return 'White'
        elif 'Middle' in row[9]:
            return 'M Eastern'
        else:
            return row[9]
    except:
        return float('NaN')

In [231]:
df3['Ethnicity'] = df3.apply(get_ethnicity, axis=1) #update Ethnicity column
df3['Ethnicity'].value_counts()

White          79615
Asian          20027
Hispanic        5693
M Eastern       4177
other           4102
Black           3791
Biracial        3273
Multiracial      927
Name: Ethnicity, dtype: int64

Clean Gender column

In [232]:
#change values with value counts less than 1100 to gender non-conforming
c = df3['Gender'].value_counts()
df3['Gender'] = np.where(df3['Gender'].isin(c.index[c<1100]), 'gender non-conforming', df3['Gender'])
df3['Gender'].value_counts()

Man                      122922
Woman                     10055
gender non-conforming      1786
Name: Gender, dtype: int64

Create new database_count column from databases column

In [233]:
def get_num_databases(row):
    '''
    A function that returns the number of databases used 

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a numerical value representing the number of databases used
    '''
    if row[5] is None: #return 0 if na value
        return 0
    
    database_list = row[5].split(';')
    return len(database_list)

In [234]:
df3['database_count'] = df3.apply(get_num_databases, axis=1) #add values to database_count column
df3['database_count'].value_counts()

1     33958
2     32245
3     24230
0     20405
4     15502
5      8745
6      4581
7      2311
8      1078
9       452
10      179
11       74
14       62
13       36
12       29
Name: database_count, dtype: int64

Clean UndergradMajor column

In [235]:
def get_major(row):
    '''
    A function that shortens survey responses to get categorical features
    combines some majors together

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a str to update the UndergradMajor column in df
    '''
    try:
        if 'Computer' in row[14]:
            return 'Comp Sci/Eng'
        elif 'engineering' in row[14]:
            return 'Eng'
        elif 'Web' in row[14]:
            return 'Web Dev'
        elif 'health' in row[14] or 'natural' in row[14]:
            return 'Health/Nat Sci'
        elif 'Math' in row[14]:
            return 'Math/Stats'
        elif 'Information' in row[14]:
            return 'Info Tech/Sys'
        elif 'arts' in row[14]:
            return 'Arts'
        elif 'humanities' in row[14] or 'social' in row[14]:
            return 'Human/Social Sci'
        elif 'never' in row[14]:
            return 'None'
        else:
            return float('NaN')
    except:
        if row[7] is not None: #return none if never attended college
            if 'Secondary/Primary' in row[7] or 'Some' in row[7] or 'None' in row[7] or 'Student' in row[7]: 
                return 'None'
        
        return float('NaN')

In [236]:
df3['UndergradMajor'] = df3.apply(get_major, axis=1) #add values to UndergradMajor column
df3['UndergradMajor'].value_counts()

Comp Sci/Eng        76170
Eng                 10545
Info Tech/Sys        8888
Health/Nat Sci       5853
Web Dev              4965
Human/Social Sci     4715
Math/Stats           4671
None                 3209
Arts                 1898
Name: UndergradMajor, dtype: int64

Create new region column based on Country column

In [237]:
#group regions df by region
country_regions_df['Country'] = country_regions_df['Country'].str.strip() #left&right strip country col before grouping
country_regions_df['Region'] = country_regions_df['Region'].str.strip() #left&right strip region col before grouping
regions_grouped = country_regions_df.groupby('Region')['Country']

#create region dict for correct names
region_dict = {
                'SUB-SAHARAN AFRICA' : 'Africa',
                'LATIN AMER. & CARIB' : 'S America',
                'ASIA (EX. NEAR EAST)' : 'Asia',
                'WESTERN EUROPE' : 'Europe',
                'OCEANIA' : 'Australia',
                'NEAR EAST' :  'M East',
                'EASTERN EUROPE': 'Europe',
                'C.W. OF IND. STATES' : 'CIS',
                'NORTHERN AFRICA' : 'Africa',
                'NORTHERN AMERICA' : 'N America',
                'BALTICS' : 'Baltics'
                }

In [238]:
def get_region(row):
    '''
    A function that finds a countries region

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a str to add region to region column in df
    '''
    #loop through all region groups
    for group_name, df_group in regions_grouped:
        if row[4] in df_group.values: #check if country exists in a region group 
            return region_dict[group_name]
    
    #check for missed values and return correct region if not nan value
    try:
        if 'Kong' in row[4] or 'Korea' in row[4] or 'Nam' in row[4] or 'Lao' in row[4]:
            return 'Asia'
        elif 'Congo' in row[4] or 'Gambia' in row[4] or 'Trinidad' in row[4] or 'Tanzania' in row[4] or 'Côte' in row[4]:
            return 'Africa'
        elif 'Syria' in row[4] or 'Libya' in row[4] or 'Myanmar' in row[4] or 'Nomadic' in row[4]:
            return 'M East'
        elif 'Bosnia' in row[4] or 'Moldova' in row[4] or 'Macedonia' in row[4] or 'Kosovo' in row[4] or 'Montenegro' in row[4]:
            return 'Europe'
        elif 'Venezuela' in row[4]:
            return 'S America'
        elif 'Russia' in row[4]:
            return 'CIS'
        else:
            return 'other'
    except:
        return float('NaN')

In [239]:
df3['Region'] = df3.apply(get_region, axis=1) #add values to region column
df3['Region'].value_counts()

Europe       52655
N America    37464
Asia         26626
S America     8030
Africa        4952
CIS           4880
M East        4314
Australia     3853
Baltics        969
other          144
Name: Region, dtype: int64

Combine MainBranch, DevType and Employment columns

In [240]:
def edit_DevType(row):
    '''
    A function that combines 3 columns together
    If DevType column is empty, MainBranch is used to fill, then Employment if other 2 are both nan values

    Parameters
    ----------
    row : row of df

    Returns
    -------
    a list of BevTypes or occupation to DevType column
    '''
    if row[6] is not None: #return list of DevTypes
        dev_list = row[6].split(';')
        return [sub.replace('Developer, ', '') for sub in dev_list] 
        
    else:
        if row[1] is not None: #check if student, retired, or sometimes code for work
            if 'student' in row[1]:
                return ['Student']
            elif 'used to be' in row[1]:
                return ['Retired Dev']
            elif 'sometimes' in row[1]:
                return ['Sometimes Code at Work']
        elif row[8] is not None: #if other columns are empty, check if employed 
            return ['Other Occupation']
        else:
            return float('NaN')

In [253]:
df4 = df3.copy()
df4['DevType'] = df4.apply(edit_DevType, axis=1) #add values to region column

Create DevTpes and languages columns and manualy one hot encode from lists in columns

In [254]:
def add_binary_column(obj_list, str_search):
    '''
    A fucntion for one hot encoding a column by checking if value is in a list from devtype/language column in df

    Parameters
    ----------
    obj_list : list from devtype or language column
    str_search : check for this string in obj_list

    Returns
    -------
    Yes/No if string in list
    '''
    try:
        for obj in obj_list:
            if str_search in obj:
                return 'Yes'
        return 'No'
    except: #return list if nan
        return float('NaN')

In [255]:
devtype_columns = ['back-end', 'full-stack', 'front-end', 'desktop', 'mobile', 'DevOps', 'Database admin', 'Designer',
                 'System admin', 'Student', 'Other Occupation', 'Retired Dev','Sometimes Code at Work']
for col in devtype_columns:
    x=0
    df4[col] = df4.apply(lambda x: add_binary_column(x['DevType'], col), axis=1)
    
lang_columns = ['JavaScript', 'Python', 'SQL', 'Java', 'HTML/CSS']
for col in lang_columns:
    x=0
    df4[col] = df4.apply(lambda x: add_binary_column(x['language'], col), axis=1)

drop uneeded or combined columns

In [256]:
df4.drop(labels=['MainBranch', 'Employment', 'DevType', 'developertools', 'databases',
               'language'], axis=1, inplace=True)

In [257]:
df4.describe()

,Age,Age1stCode,YearsCode,YearsCodePro,database_count
count,123638.000000,139751.000000,138497.000000,110724.000000,143887.000000
mean,30.486403,15.436920,12.198293,8.705502,2.345688
std,9.258228,5.006913,9.187212,7.597813,1.843485
min,1.000000,5.000000,1.000000,1.000000,0.000000
25%,24.000000,12.000000,5.000000,3.000000,1.000000
50%,29.000000,15.000000,10.000000,6.000000,2.000000
75%,35.000000,18.000000,16.000000,12.000000,3.000000
max,279.000000,85.000000,50.000000,50.000000,14.000000

Clean Age, Age1stCode, and YearsCodePro column

In [258]:
df4 = df4[df4['Age'] < 70] #max was 279, avg age of death is around 80
df4 = df4[df4['Age'] > 10] #set min age, was 1
df4 = df4[df4['Age1stCode'] < 60] #max was 85, which seems very unrealistic
df4 = df4[df4['Age1stCode'] > 8] #set min age first code, was 5

df4 = df4[df4['YearsCode'] >= df4['YearsCodePro']] #check that coding expereince is greater than ro equal to prof coding exp
df4 = df4[df4['Age'] >= df4['Age1stCode']] #check that age is greater than or equal to Age1stCode

df4 = df4[df4['Age'] > (df4['YearsCode']+10)] #check that age is greater than or equal to Age1stCode

df4['YearsCodePro'] = df4['YearsCodePro'].fillna(value=0) #fill na values with 0 because non-prof coders included in survey
df4.describe()

                Age    Age1stCode     YearsCode  YearsCodePro  database_count
count  87473.000000  87473.000000  87473.000000  87473.000000    87473.000000
mean      31.763008     15.892413     12.928069      8.143061        2.476444
std        8.371041      4.170130      8.537636      7.241059        1.807581
min       12.000000      9.000000      1.000000      1.000000        0.000000
25%       26.000000     13.000000      7.000000      3.000000        1.000000
50%       30.000000     15.000000     10.000000      6.000000        2.000000
75%       35.000000     18.000000     17.000000     10.000000        3.000000
max       69.000000     55.000000     50.000000     50.000000       14.000000

In [259]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 87473 entries, 4 to 143730
Data columns (total 31 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Hobbyist                87473 non-null  object
 1   Age                     87473 non-null  float64
 2   Age1stCode              87473 non-null  float64
 3   Country                 87473 non-null  object
 4   EdLevel                 86106 non-null  object
 5   Ethnicity               79639 non-null  object
 6   Gender                  86506 non-null  object
 7   OpSys                   87473 non-null  category
 8   UndergradMajor          79590 non-null  object
 9   YearsCode               87473 non-null  float64
 10  YearsCodePro            87473 non-null  float64
 11  database_count          87473 non-null  int64
 12  Region                  87473 non-null  object
 13  JavaScript              87087 non-null  object
 14  Python                  87087 non-null  object
 15  SQL                     87087 non-null  object
 16  Java                    87087 non-null  object
 17  HTML/CSS                87087 non-null  object
 18  back-end                86811 non-null  object
 19  full-stack              86811 non-null  object
 20  front-end               86811 non-null  object
 21  desktop                 86811 non-null  object
 22  mobile                  86811 non-null  object
 23  DevOps                  86811 non-null  object
 24  Database admin          86811 non-null  object
 25  Designer                86811 non-null  object
 26  System admin            86811 non-null  object
 27  Student                 86811 non-null  object
 28  Other Occupation        86811 non-null  object
 29  Retired Dev             86811 non-null  object
 30  Sometimes Code at Work  86811 non-null  object
dtypes: category(1), float64(4), int64(1), object(25)
memory usage: 20.8+ MB

Upload df4 cleaned data as sql table "cleaned_survey_data6"

In [260]:
# df4.to_sql('cleaned_survey_data6', engine, index=False)

New df with removed na values

In [261]:
df5 = df4.copy()
df5 = df5.dropna()
df5.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70101 entries, 33 to 143730
Data columns (total 31 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Hobbyist                70101 non-null  object
 1   Age                     70101 non-null  float64
 2   Age1stCode              70101 non-null  float64
 3   Country                 70101 non-null  object
 4   EdLevel                 70101 non-null  object
 5   Ethnicity               70101 non-null  object
 6   Gender                  70101 non-null  object
 7   OpSys                   70101 non-null  category
 8   UndergradMajor          70101 non-null  object
 9   YearsCode               70101 non-null  float64
 10  YearsCodePro            70101 non-null  float64
 11  database_count          70101 non-null  int64
 12  Region                  70101 non-null  object
 13  JavaScript              70101 non-null  object
 14  Python                  70101 non-null  object
 15  SQL                     70101 non-null  object
 16  Java                    70101 non-null  object
 17  HTML/CSS                70101 non-null  object
 18  back-end                70101 non-null  object
 19  full-stack              70101 non-null  object
 20  front-end               70101 non-null  object
 21  desktop                 70101 non-null  object
 22  mobile                  70101 non-null  object
 23  DevOps                  70101 non-null  object
 24  Database admin          70101 non-null  object
 25  Designer                70101 non-null  object
 26  System admin            70101 non-null  object
 27  Student                 70101 non-null  object
 28  Other Occupation        70101 non-null  object
 29  Retired Dev             70101 non-null  object
 30  Sometimes Code at Work  70101 non-null  object
dtypes: category(1), float64(4), int64(1), object(25)
memory usage: 16.6+ MB

In [262]:
df5.to_pickle('../Data/survey_data_cleaned2.pkl')

In [263]:
df5.columns

Index(['Hobbyist', 'Age', 'Age1stCode', 'Country', 'EdLevel', 'Ethnicity',
       'Gender', 'OpSys', 'UndergradMajor', 'YearsCode', 'YearsCodePro',
       'database_count', 'Region', 'JavaScript', 'Python', 'SQL', 'Java',
       'HTML/CSS', 'back-end', 'full-stack', 'front-end', 'desktop', 'mobile',
       'DevOps', 'Database admin', 'Designer', 'System admin', 'Student',
       'Other Occupation', 'Retired Dev', 'Sometimes Code at Work'],
      dtype='object')